app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.get_ratings        #instantiate @all_ratings by making a call to method get_ratings defined in Movie model


    @sort = params[:sort]                   #instantiate @sort to URI sort parameter
    @checked_ratings = []                   #instantiate @checked_ratings empty array. Use: keep track of checked ratings

    if (params[:sort])                      #execute if params[:sort] exists.  Occurs after sort link is clicked
      session[:sort] = params[:sort]        #if it exists, instantiate session[:sort] to the value
    end

    if (params[:ratings])                   #execute if params[:ratings] exists.  Occurs after boxes are checked
      session[:ratings] = params[:ratings]  #if it exists, instantiate session[:ratings] to the value
      params[:ratings].each_key do |k|      #iterate through keys of params[:ratings], and for each key,
        @checked_ratings << k               #append that key to @checked_ratings
      end
      @movies = Movie.find(:all, :order => @sort, :conditions => {:rating => @checked_ratings})   #set @movies to all movies in the database with the same ratings that are stored in @checked_ratings, while keeping the order from @sort
    else
      if (session[:ratings])                                                    #if session[:ratings] exists
        flash.keep                                                              #do not overwrite message in flash
        redirect_to(:sort => session[:sort], :ratings => session[:ratings])     #and redirect to URI with previous parameters still existing
      end
      @movies = Movie.order(@sort).all      #set @movies to all movies in the database with the column designated by @sort ordered
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13') ORDER BY title
SELECT "movies".* FROM "movies" ORDER BY release_date